package module3.task2;

/**
 * Created by sovra on 08.02.2017.
 */
public class Arithmetic {
public int add (Integer a, Integer b){
    System.out.print("Class Arithmetic add: ");
    return a+b;
}
//    Напишите класс с названием Arithmetic с методом add, который принимает
//  целые числа как параметры и возвращает переменную типа integer, которая есть их суммой.
// 
//    Напишите класс Adder, который наследуется от класса Arithmetic. У класса Adder должен быть
// метод check, который сравнивает 2 номера и возвращает true, если а>=b и false в других случаях.
// 
//    Сигнатура методов:
//    int add(Integer a, Integer b)
//    boolean check(Integer a, Integer b)

}
